Tasks/ЗадачаОбратнаяСвязь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Task>
		<Properties>
			<Name>ЗадачаОбратнаяСвязь</Name>
			<Addressing>InformationRegister.АдресацияЗадач</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>Дата выполнения фактическая</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительФакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Постановщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наблюдатель</Name>
					<Comment>Наблюдатель (линейный руководитель)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помошник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Ответ исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаВыполненияПредшествующейЗадачи</Name>
					<Comment>Если некачественный ответ клиентской службы региона, тогда 1, если это задача на веделение, тогда 2</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
					<Comment>Исполнители плановые</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Comment>Исполнитель плановый</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель плановый</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ЗадачаОбратнаяСвязь/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
		
	//Перед записью не выполненной задачи
	//===================================	
	Если Не Выполнена Тогда
		Если ТипЗнч(ЭтотОбъект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ОбратнаяСвязьЛояльности") Тогда
			//Плановый исполнитель
			//---------------------
			Если Не ЗначениеЗаполнено(Исполнитель) Тогда
				Исполнитель = ПроцессыСервер.НазначьИсполнителя(Роль, Подразделение, ДопРеквизитАдресации);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	//При записи выполненной задачи
	//=============================	
	Если Выполнена Тогда
		//Фактический исполнитель
		//------------------------
		Если Не ЗначениеЗаполнено(ИсполнительФакт) Тогда  
			ИсполнительФакт = ПараметрыСеанса.ТекущийПользователь; 
		КонецЕсли;
	
		//Дата выполнения
		//----------------
		Если Не ЗначениеЗаполнено(ДатаВыполнения) Тогда
			ДатаВыполнения = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СтрНайти(Наименование, "Проверить") Тогда
		
		Если Не ЗначениеЗаполнено(ОценкаВыполненияПредшествующейЗадачи)Тогда
    
   	 	// Если он не заполнен, сообщим об этом пользователю
		//--------------------------------------------------
 	   	Сообщение = Новый СообщениеПользователю();
    	Сообщение.Текст = "Не указана оценка";
    	Сообщение.Поле = "ОценкаВыполненияПредшествующейЗадачи";
    	Сообщение.УстановитьДанные(ЭтотОбъект);
    	Сообщение.Сообщить();
		
		Сообщить( "Не указана оценка");

    	// Сообщим платформе, что мы сами обработали проверку заполнения реквизита "Покупатель"
		//--------------------------------------------------------------------------------------
   		// ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОценкаВыполненияПредшествующейЗадачи"));
   		 Отказ = Истина;

	КонецЕсли;
        
КонецЕсли;


КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры
